is1200-example-projects/mcb32tools/headers/proc/p32mz2048ecm144.h
extern volatile __AD1CMPEN6bits_t AD1CMPEN6bits __asm__ ("AD1CMPEN6") __attribute__((section("sfrs")));
extern volatile unsigned int        AD1CMP6 __attribute__((section("sfrs")));
typedef struct {
  unsigned ADCMPLO:16;
  unsigned ADCMPHI:16;
} __AD1CMP6bits_t;
extern volatile __AD1CMP6bits_t AD1CMP6bits __asm__ ("AD1CMP6") __attribute__((section("sfrs")));
extern volatile unsigned int        AD1FLTR1 __attribute__((section("sfrs")));
typedef struct {
  unsigned FLTRDATA:16;
  unsigned CHNLID:6;
  unsigned :2;
  unsigned AFRDY:1;
  unsigned AFGIEN:1;
  unsigned OVRSAM:3;
  unsigned :2;
  unsigned AFEN:1;
} __AD1FLTR1bits_t;
extern volatile __AD1FLTR1bits_t AD1FLTR1bits __asm__ ("AD1FLTR1") __attribute__((section("sfrs")));
extern volatile unsigned int        AD1FLTR2 __attribute__((section("sfrs")));
typedef struct {
  unsigned FLTRDATA:16;
  unsigned CHNLID:6;
  unsigned :2;
  unsigned AFRDY:1;
  unsigned AFGIEN:1;
  unsigned OVRSAM:3;
  unsigned :2;
  unsigned AFEN:1;
} __AD1FLTR2bits_t;
extern volatile __AD1FLTR2bits_t AD1FLTR2bits __asm__ ("AD1FLTR2") __attribute__((section("sfrs")));
extern volatile unsigned int        AD1FLTR3 __attribute__((section("sfrs")));
typedef struct {
  unsigned FLTRDATA:16;
  unsigned CHNLID:6;
  unsigned :2;
  unsigned AFRDY:1;
  unsigned AFGIEN:1;
  unsigned OVRSAM:3;
  unsigned :2;
  unsigned AFEN:1;
} __AD1FLTR3bits_t;
extern volatile __AD1FLTR3bits_t AD1FLTR3bits __asm__ ("AD1FLTR3") __attribute__((section("sfrs")));
extern volatile unsigned int        AD1FLTR4 __attribute__((section("sfrs")));
typedef struct {
  unsigned FLTRDATA:16;
  unsigned CHNLID:6;
  unsigned :2;
  unsigned AFRDY:1;
  unsigned AFGIEN:1;
  unsigned OVRSAM:3;
  unsigned :2;
  unsigned AFEN:1;
} __AD1FLTR4bits_t;
extern volatile __AD1FLTR4bits_t AD1FLTR4bits __asm__ ("AD1FLTR4") __attribute__((section("sfrs")));
extern volatile unsigned int        AD1FLTR5 __attribute__((section("sfrs")));
typedef struct {
  unsigned FLTRDATA:16;
  unsigned CHNLID:6;
  unsigned :2;
  unsigned AFRDY:1;
  unsigned AFGIEN:1;
  unsigned OVRSAM:3;
  unsigned :2;
  unsigned AFEN:1;
} __AD1FLTR5bits_t;
extern volatile __AD1FLTR5bits_t AD1FLTR5bits __asm__ ("AD1FLTR5") __attribute__((section("sfrs")));
extern volatile unsigned int        AD1FLTR6 __attribute__((section("sfrs")));
typedef struct {
  unsigned FLTRDATA:16;
  unsigned CHNLID:6;
  unsigned :2;
  unsigned AFRDY:1;
  unsigned AFGIEN:1;
  unsigned OVRSAM:3;
  unsigned :2;
  unsigned AFEN:1;
} __AD1FLTR6bits_t;
extern volatile __AD1FLTR6bits_t AD1FLTR6bits __asm__ ("AD1FLTR6") __attribute__((section("sfrs")));
extern volatile unsigned int        AD1TRG1 __attribute__((section("sfrs")));
typedef struct {
  unsigned TRGSRC0:5;
  unsigned :3;
  unsigned TRGSRC1:5;
  unsigned :3;
  unsigned TRGSRC2:5;
  unsigned :3;
  unsigned TRGSRC3:5;
} __AD1TRG1bits_t;
extern volatile __AD1TRG1bits_t AD1TRG1bits __asm__ ("AD1TRG1") __attribute__((section("sfrs")));
extern volatile unsigned int        AD1TRG2 __attribute__((section("sfrs")));
typedef struct {
  unsigned TRGSRC4:5;
  unsigned :3;
  unsigned TRGSRC5:5;
  unsigned :3;
  unsigned TRGSRC6:5;
  unsigned :3;
  unsigned TRGSRC7:5;
} __AD1TRG2bits_t;
extern volatile __AD1TRG2bits_t AD1TRG2bits __asm__ ("AD1TRG2") __attribute__((section("sfrs")));
extern volatile unsigned int        AD1TRG3 __attribute__((section("sfrs")));
typedef struct {
  unsigned TRGSRC8:5;
  unsigned :3;
  unsigned TRGSRC9:5;
  unsigned :3;
  unsigned TRGSRC10:5;
  unsigned :3;
  unsigned TRGSRC11:5;
} __AD1TRG3bits_t;
extern volatile __AD1TRG3bits_t AD1TRG3bits __asm__ ("AD1TRG3") __attribute__((section("sfrs")));
extern volatile unsigned int        AD1CMPCON1 __attribute__((section("sfrs")));
typedef struct {
  unsigned IELOLO:1;
  unsigned IELOHI:1;
  unsigned IEHILO:1;
  unsigned IEHIHI:1;
  unsigned IEBTWN:1;
  unsigned DCMPED:1;
  unsigned DCMPGIEN:1;
  unsigned ENDCMP:1;
  unsigned AINID:5;
} __AD1CMPCON1bits_t;
extern volatile __AD1CMPCON1bits_t AD1CMPCON1bits __asm__ ("AD1CMPCON1") __attribute__((section("sfrs")));
extern volatile unsigned int        AD1CMPCON2 __attribute__((section("sfrs")));
typedef struct {
  unsigned IELOLO:1;
  unsigned IELOHI:1;
  unsigned IEHILO:1;
  unsigned IEHIHI:1;
  unsigned IEBTWN:1;
  unsigned DCMPED:1;
  unsigned DCMPGIEN:1;
  unsigned ENDCMP:1;
  unsigned AINID:5;
} __AD1CMPCON2bits_t;
extern volatile __AD1CMPCON2bits_t AD1CMPCON2bits __asm__ ("AD1CMPCON2") __attribute__((section("sfrs")));
extern volatile unsigned int        AD1CMPCON3 __attribute__((section("sfrs")));
typedef struct {
  unsigned IELOLO:1;
  unsigned IELOHI:1;
  unsigned IEHILO:1;
  unsigned IEHIHI:1;
  unsigned IEBTWN:1;
  unsigned DCMPED:1;
  unsigned DCMPGIEN:1;
  unsigned ENDCMP:1;
  unsigned AINID:5;
} __AD1CMPCON3bits_t;
extern volatile __AD1CMPCON3bits_t AD1CMPCON3bits __asm__ ("AD1CMPCON3") __attribute__((section("sfrs")));
extern volatile unsigned int        AD1CMPCON4 __attribute__((section("sfrs")));
typedef struct {
  unsigned IELOLO:1;
  unsigned IELOHI:1;
  unsigned IEHILO:1;
  unsigned IEHIHI:1;
  unsigned IEBTWN:1;
  unsigned DCMPED:1;
  unsigned DCMPGIEN:1;
  unsigned ENDCMP:1;
  unsigned AINID:5;
} __AD1CMPCON4bits_t;
extern volatile __AD1CMPCON4bits_t AD1CMPCON4bits __asm__ ("AD1CMPCON4") __attribute__((section("sfrs")));
extern volatile unsigned int        AD1CMPCON5 __attribute__((section("sfrs")));
typedef struct {
  unsigned IELOLO:1;
  unsigned IELOHI:1;
  unsigned IEHILO:1;
  unsigned IEHIHI:1;
  unsigned IEBTWN:1;
  unsigned DCMPED:1;
  unsigned DCMPGIEN:1;
  unsigned ENDCMP:1;
  unsigned AINID:5;
} __AD1CMPCON5bits_t;
extern volatile __AD1CMPCON5bits_t AD1CMPCON5bits __asm__ ("AD1CMPCON5") __attribute__((section("sfrs")));
extern volatile unsigned int        AD1CMPCON6 __attribute__((section("sfrs")));
typedef struct {
  unsigned IELOLO:1;
  unsigned IELOHI:1;
  unsigned IEHILO:1;
  unsigned IEHIHI:1;
  unsigned IEBTWN:1;
  unsigned DCMPED:1;
  unsigned DCMPGIEN:1;
  unsigned ENDCMP:1;
  unsigned AINID:5;
} __AD1CMPCON6bits_t;
extern volatile __AD1CMPCON6bits_t AD1CMPCON6bits __asm__ ("AD1CMPCON6") __attribute__((section("sfrs")));
extern volatile unsigned int        AD1DATA0 __attribute__((section("sfrs")));
typedef struct {
  unsigned DATA:32;
} __AD1DATA0bits_t;
extern volatile __AD1DATA0bits_t AD1DATA0bits __asm__ ("AD1DATA0") __attribute__((section("sfrs")));
extern volatile unsigned int        AD1DATA1 __attribute__((section("sfrs")));
typedef struct {
  unsigned DATA:32;
} __AD1DATA1bits_t;
extern volatile __AD1DATA1bits_t AD1DATA1bits __asm__ ("AD1DATA1") __attribute__((section("sfrs")));
extern volatile unsigned int        AD1DATA2 __attribute__((section("sfrs")));
typedef struct {
  unsigned DATA:32;
} __AD1DATA2bits_t;
