is1200-example-projects/mcb32tools/headers/proc/p32mz2048ecm144.h
#define _TRISJ_TRISJ13_POSITION                  0x0000000D
#define _TRISJ_TRISJ13_MASK                      0x00002000
#define _TRISJ_TRISJ13_LENGTH                    0x00000001

#define _TRISJ_TRISJ14_POSITION                  0x0000000E
#define _TRISJ_TRISJ14_MASK                      0x00004000
#define _TRISJ_TRISJ14_LENGTH                    0x00000001

#define _TRISJ_TRISJ15_POSITION                  0x0000000F
#define _TRISJ_TRISJ15_MASK                      0x00008000
#define _TRISJ_TRISJ15_LENGTH                    0x00000001

#define _TRISJ_w_POSITION                        0x00000000
#define _TRISJ_w_MASK                            0xFFFFFFFF
#define _TRISJ_w_LENGTH                          0x00000020

#define _PORTJ_RJ0_POSITION                      0x00000000
#define _PORTJ_RJ0_MASK                          0x00000001
#define _PORTJ_RJ0_LENGTH                        0x00000001

#define _PORTJ_RJ1_POSITION                      0x00000001
#define _PORTJ_RJ1_MASK                          0x00000002
#define _PORTJ_RJ1_LENGTH                        0x00000001

#define _PORTJ_RJ2_POSITION                      0x00000002
#define _PORTJ_RJ2_MASK                          0x00000004
#define _PORTJ_RJ2_LENGTH                        0x00000001

#define _PORTJ_RJ3_POSITION                      0x00000003
#define _PORTJ_RJ3_MASK                          0x00000008
#define _PORTJ_RJ3_LENGTH                        0x00000001

#define _PORTJ_RJ4_POSITION                      0x00000004
#define _PORTJ_RJ4_MASK                          0x00000010
#define _PORTJ_RJ4_LENGTH                        0x00000001

#define _PORTJ_RJ5_POSITION                      0x00000005
#define _PORTJ_RJ5_MASK                          0x00000020
#define _PORTJ_RJ5_LENGTH                        0x00000001

#define _PORTJ_RJ6_POSITION                      0x00000006
#define _PORTJ_RJ6_MASK                          0x00000040
#define _PORTJ_RJ6_LENGTH                        0x00000001

#define _PORTJ_RJ7_POSITION                      0x00000007
#define _PORTJ_RJ7_MASK                          0x00000080
#define _PORTJ_RJ7_LENGTH                        0x00000001

#define _PORTJ_RJ8_POSITION                      0x00000008
#define _PORTJ_RJ8_MASK                          0x00000100
#define _PORTJ_RJ8_LENGTH                        0x00000001

#define _PORTJ_RJ9_POSITION                      0x00000009
#define _PORTJ_RJ9_MASK                          0x00000200
#define _PORTJ_RJ9_LENGTH                        0x00000001

#define _PORTJ_RJ10_POSITION                     0x0000000A
#define _PORTJ_RJ10_MASK                         0x00000400
#define _PORTJ_RJ10_LENGTH                       0x00000001

#define _PORTJ_RJ11_POSITION                     0x0000000B
#define _PORTJ_RJ11_MASK                         0x00000800
#define _PORTJ_RJ11_LENGTH                       0x00000001

#define _PORTJ_RJ12_POSITION                     0x0000000C
#define _PORTJ_RJ12_MASK                         0x00001000
#define _PORTJ_RJ12_LENGTH                       0x00000001

#define _PORTJ_RJ13_POSITION                     0x0000000D
#define _PORTJ_RJ13_MASK                         0x00002000
#define _PORTJ_RJ13_LENGTH                       0x00000001

#define _PORTJ_RJ14_POSITION                     0x0000000E
#define _PORTJ_RJ14_MASK                         0x00004000
#define _PORTJ_RJ14_LENGTH                       0x00000001

#define _PORTJ_RJ15_POSITION                     0x0000000F
#define _PORTJ_RJ15_MASK                         0x00008000
#define _PORTJ_RJ15_LENGTH                       0x00000001

#define _PORTJ_w_POSITION                        0x00000000
#define _PORTJ_w_MASK                            0xFFFFFFFF
#define _PORTJ_w_LENGTH                          0x00000020

#define _LATJ_LATJ0_POSITION                     0x00000000
#define _LATJ_LATJ0_MASK                         0x00000001
#define _LATJ_LATJ0_LENGTH                       0x00000001

#define _LATJ_LATJ1_POSITION                     0x00000001
#define _LATJ_LATJ1_MASK                         0x00000002
#define _LATJ_LATJ1_LENGTH                       0x00000001

#define _LATJ_LATJ2_POSITION                     0x00000002
#define _LATJ_LATJ2_MASK                         0x00000004
#define _LATJ_LATJ2_LENGTH                       0x00000001

#define _LATJ_LATJ3_POSITION                     0x00000003
#define _LATJ_LATJ3_MASK                         0x00000008
#define _LATJ_LATJ3_LENGTH                       0x00000001

#define _LATJ_LATJ4_POSITION                     0x00000004
#define _LATJ_LATJ4_MASK                         0x00000010
#define _LATJ_LATJ4_LENGTH                       0x00000001

#define _LATJ_LATJ5_POSITION                     0x00000005
#define _LATJ_LATJ5_MASK                         0x00000020
#define _LATJ_LATJ5_LENGTH                       0x00000001

#define _LATJ_LATJ6_POSITION                     0x00000006
#define _LATJ_LATJ6_MASK                         0x00000040
#define _LATJ_LATJ6_LENGTH                       0x00000001

#define _LATJ_LATJ7_POSITION                     0x00000007
#define _LATJ_LATJ7_MASK                         0x00000080
#define _LATJ_LATJ7_LENGTH                       0x00000001

#define _LATJ_LATJ8_POSITION                     0x00000008
#define _LATJ_LATJ8_MASK                         0x00000100
#define _LATJ_LATJ8_LENGTH                       0x00000001

#define _LATJ_LATJ9_POSITION                     0x00000009
#define _LATJ_LATJ9_MASK                         0x00000200
#define _LATJ_LATJ9_LENGTH                       0x00000001

#define _LATJ_LATJ10_POSITION                    0x0000000A
#define _LATJ_LATJ10_MASK                        0x00000400
#define _LATJ_LATJ10_LENGTH                      0x00000001

#define _LATJ_LATJ11_POSITION                    0x0000000B
#define _LATJ_LATJ11_MASK                        0x00000800
#define _LATJ_LATJ11_LENGTH                      0x00000001

#define _LATJ_LATJ12_POSITION                    0x0000000C
#define _LATJ_LATJ12_MASK                        0x00001000
#define _LATJ_LATJ12_LENGTH                      0x00000001

#define _LATJ_LATJ13_POSITION                    0x0000000D
#define _LATJ_LATJ13_MASK                        0x00002000
#define _LATJ_LATJ13_LENGTH                      0x00000001

#define _LATJ_LATJ14_POSITION                    0x0000000E
#define _LATJ_LATJ14_MASK                        0x00004000
#define _LATJ_LATJ14_LENGTH                      0x00000001

#define _LATJ_LATJ15_POSITION                    0x0000000F
#define _LATJ_LATJ15_MASK                        0x00008000
#define _LATJ_LATJ15_LENGTH                      0x00000001

#define _LATJ_w_POSITION                         0x00000000
#define _LATJ_w_MASK                             0xFFFFFFFF
#define _LATJ_w_LENGTH                           0x00000020

#define _ODCJ_ODCJ0_POSITION                     0x00000000
#define _ODCJ_ODCJ0_MASK                         0x00000001
#define _ODCJ_ODCJ0_LENGTH                       0x00000001

